import { ILetter } from '../src/types/letter'

export const news20191122: ILetter = {
  id: '2019-11-22',
  title: 'IT塾スオウパーティを創業しました',
  description: '当社事業内容の筆頭に掲げている教育・人材育成の事業を開始します。',
  thumbnail: '/news/20191122/thumbnail.png',
  date: '2019-11-22T09:00:00.000Z',
  tags: ['会社, 教育'],
  paragraphs: [
    {
      type: 'text',
      text: 'パソコン・インターネット・プログラミングを使う制作活動を通してITの知識や使い方を身に付け、将来の仕事の基礎となる創造力と実務能力を育みます。',
    },
    {
      type: 'text',
      text: '事業名の「パーティ」は、ITを学び制作活動を行う集団を指すのと同時に、ワイワイガヤガヤ時間を忘れて制作を楽しむパーティにしたいと思いから名付けました。事業ロゴは、脳内でモジュールやアイデアを組み合わせそれを形にできることで生まれる満ち溢れる自信と価値を生み出す喜びを表しています。',
    },
    {
      type: 'text',
      text: '昨今の目まぐるしいIT技術の発展により、インターネットであらゆるものを知ることができ、教育の分野でも場所・環境を問わず学習することが可能になりました。一方で、それらを上手く活用できない方・学習を継続できない方も少なくありません。スオウパーティはそのような方と対面でしっかり向き合い伴走できればと考えています。',
    },
    {
      type: 'text',
      text: 'まずは小・中学生を対象としてビジュアルプログラミングからスタートします。詳細は下記Webサイトをご覧ください。',
    },
    {
      type: 'link',
      url: 'https://thwoo.party',
    },
  ],
}
