import { ILetter } from '../src/types/letter'

export const news20190613: ILetter = {
  id: '2019-06-13',
  title: '株式会社スオウを設立しました',
  description:
    '社名は古来の行政区分である令制国の山口県中東部を指す周防国（すおうこく）から取りました。',
  thumbnail: '/news/20190613/thumbnail.png',
  date: '2019-06-13T09:00:00.000Z',
  tags: ['会社'],
  paragraphs: [
    {
      type: 'text',
      text: '山口県防府市を起点として社会に大きく貢献できる会社を目指します。英名Thwooは私のイニシャルの「Th」と切望する/求愛するという動詞「woo」を足した造語です。私が社会や世の皆さんに対して、このモットーを訴えていく場所という意味も込めました。',
    },
    {
      type: 'text',
      text: '人は成りたい自分に成れる',
      isBold: true,
    },
    {
      type: 'text',
      text: '生まれる時代や国が違えば、どうにもできない悲惨な環境が過去にたくさんありましたし、今でもたくさんあります。それに対し今の日本は、ほとんどの人が自分の思うように生きていける恵まれた環境です。各個人が前向きに挑戦する気持ちを持ち続けることができれば、たくましく強くなることができれば、そして他者に優しくできれば、世の中はもっと良い方向に向かうのではないでしょうか。',
    },
    {
      type: 'text',
      text: '事業の筆頭に「教育」「人材育成」を掲げました。個人の自己実現やそれらを後押しする事業者を全力でサポートします。私も地方から大きな活力を生み出している自分をイメージしてこの会社を興すに至りました。私自身、永遠にこのモットーを体現する一個人であり続けます。',
    },
    {
      type: 'text',
      text: '株式会社スオウ 代表取締役　原田 哲也',
    },
  ],
}
