import { ILetter } from '../src/types/letter'

export const news20210622: ILetter = {
  id: '2021-06-22',
  title: '山口大学の学外講師を務めました',
  description:
    '将来教員を目指す教育学部1年生の講座「データ科学と社会Ⅱ」の学外講師を務めました。「プログラミング教育の実践紹介」を講義しました。',
  thumbnail: '/news/20210622/thumbnail.jpg',
  date: '2021-06-22T09:00:00.000Z',
  tags: ['教育'],
  paragraphs: [
    {
      type: 'text',
      text: '昨年に引き続き2回目で、IT塾スオウパーティの取り組みや指導方法を紹介しました。まず最初に、背景として文科省が公開している「プログラミング教育の手引き」を開いて冒頭の重要な部分を紹介しました。プログラミング教育を通して、機械に内臓されるプログラムやソフトウェアの存在を知り、それを活用していく力を育むこと、が重要であると書かれています。',
    },
    {
      type: 'text',
      text: '次に教材で使っているスクラッチの紹介をしました。プログラミング教育の分野では非常に有名なサービスですが、知らない学生がほとんどでした。画面と操作方法を説明した後、簡単なミニゲームのライブコーディングを行い、その手軽さを感じてもらいました。また同じゲームでも、違う作り方で実現できる形を見せて、どちらが良いプログラミングかを解説しました。容易に変更できる質の高いソフトウェアは資産となり、そうでない扱いづらいものは負債となってしまいます。',
    },
    {
      type: 'image',
      image: {
        src: '/news/20210622/image1.jpg',
        width: 1200,
        height: 900,
        alt: '教室外観1',
      },
    },
    {
      type: 'text',
      text: '講義の終盤は、プログラミングの思考法やTipsを4つ話しました。「乱数と確率」「じゃんけんとAI」「同期と非同期」「抽象化」です。先に述べた「機械に内臓されるプログラムやソフトウェアの存在を知る」ためには、このような実生活の物事を題材にすることが重要であることを伝えました。',
    },
    {
      type: 'image',
      image: {
        src: '/news/20210622/image2.jpg',
        width: 1200,
        height: 900,
        alt: '教室外観2',
      },
    },
    {
      type: 'text',
      text: '最後に、講義後に受講生の感想を共有頂いたので一部紹介します。スクラッチに好意的な意見が多くありました。新たに教員になる学生たちがプログラミング教育をしっかり担っていただけると幸いです。',
    },
    {
      type: 'list',
      items: [
        'スクラッチというプログラミングソフトがあることを初めて知って面白そうだなと思った。 計算機概論で使えるような知識があって参考になった。',
        'プログラミングは難しいものだと思っていたけど、スクラッチのようなパズルみたいにはめ込んでいくのはとてもわかりやすくて、苦手意識を持つ子供が少なくなると思いました。',
        '日本語に言語化してさらに色をつけて条件を当てはめていくのは子供たちにとってもすごく楽しそうだなと思いました。将来、生徒たちに教える立場としてしっかり習得できるよう頑張りたいと思います。',
        '日本語の構文を組み合わせて作り上げているのは新鮮でとても面白かったです。 プログラム初心者の自分とかは今回の講義でしようしたスクラッチのほうが興味関心などの点も含めて適しているなと思いました。',
        '子供がパソコンを触って考えるだけではなく、打つ前にどうすれば上手くできるかを考えてから行うことは重要なことだと思った。プログラミングだけでなく今後の教え方にもつながると思ったのでためになった。',
        '私は将来技術の教員になるのでプログラミングについて学ぶことができて良かったです。プログラミングやパソコン関係は弱い部分があるので不安ですが、焦らず頑張ろうと思います。',
      ],
      isItalic: true,
    },
  ],
}
