import { ILetter } from '../src/types/letter'

export const news20210729: ILetter = {
  id: '2021-07-29',
  title: 'デジテックforYAMAGUCHI運営参画',
  description:
    'デジテックforYAMAGUCHIは、デジタル技術を活用し山口県の地域課題の解決や新たな価値創造を持続的に取り組むための官民連携の会員組織です。',
  thumbnail: '/news/20210729/thumbnail.png',
  date: '2021-07-29T09:00:00.000Z',
  tags: ['コンサル'],
  isRecommended: false,
  paragraphs: [
    {
      type: 'text',
      text: '詳細はこちらをご覧ください。',
    },
    {
      type: 'link',
      url: 'https://digitech-ymg.org/',
    },
    {
      type: 'text',
      text: '山口県の大号令の元、6 月に産声をあげたばかりの取り組みです。「共に考え、共に挑戦する」というスローガンを掲げ、山口県のみならず日本全国の地方の課題である少子高齢化・中山間地域・若者流出を取り組むべき大テーマとして掲げています。ご縁をきっかけに県の職員の方と対話を重ね、運営の一翼を担わせていただくことになりました。',
    },
    {
      type: 'text',
      text: '様々なリソースが限られている地方をより良く回すためには、デジタル技術の活用は様々な場面で有用であることは間違いありません。一方で、道具や技術より組織や人の意識の問題であることも大いにあります。1,2 年ですぐに解決できるテーマはありません。希望が持てる未来のビジョンを想像し共有しながら、多くの方を巻き込んで取り組んで参ります。大きく2つ業務を請け負います。',
    },
    {
      type: 'text',
      text: '1つ目はシビックテック的課題と解決手法のマネジメントです。課題ホルダーの現状の把握/整理から中長期戦略を策定し、一歩目の解決方法を立案します。解決方法を推し進めるのは有志で参加される会員の方なので、彼らとのハブも担います。時には技術的なサポートも行います。3 つのプロジェクト（チーム）を担当する予定です。',
    },
    {
      type: 'text',
      text: '2つ目は事務局の運営サポートです。運営全般のアドバイスを行います。県として初の試みで専門知識を有する運営メンバが居ないのが実情です。運営自らが失敗を恐れず行動し、この取り組みが年を追う毎に加速していくよう全面的にサポートします。山口県全体の課題解決に少しでも繋がるよう全力で取り組ませていただきます。',
    },
  ],
}
