import { ILetter } from '../src/types/letter'

export const news20211007: ILetter = {
  id: '2021-10-07',
  title: '野田学園中学2年生の職場体験',
  description:
    '野田学園の「地域と仕事」をテーマとした探究学習の一環である職場体験学習を受け入れました。',
  thumbnail: '/news/20211007/thumbnail.jpg',
  date: '2021-10-07T09:00:00.000Z',
  tags: ['教育'],
  paragraphs: [
    {
      type: 'text',
      text: '野田学園中学 2 年生の 5 名が、スオウパーティ山口教室に 1 日職場体験に来ました。問題解決型の職場体験ということで、事業やサービスの困りごとに対して生徒が関心を持ち、そして解決方法について考える、という取り組みです。事前に顔合わせで話す機会があり、弊社の課題としてプログラミング教室の販促が不十分である点を共有し、解決策として教材カードと生徒の作品紹介パネルを作ることを決めていました。',
    },
    {
      type: 'text',
      text: '最初に、教材や作品をしっかり触って知ってもらうことから始めました。たくさんの作品に触れながら、中身のプログラムの作り方に関心を持つ生徒もいました。次に、制作に使う Canva という編集ツールを練習しました。午前中の最後は、改めて「なぜやるのか？対象は誰なのか？」という制作の目的を整理した上で、制作に必要な構成物を列挙していきました。QR コードですぐにデバイスで開けるようにしようというアイデアも出ました。',
    },
    {
      type: 'image',
      image: {
        src: '/news/20211007/image1.jpg',
        width: 1200,
        height: 900,
        alt: '室内の作業風',
      },
    },
    {
      type: 'text',
      text: 'お昼休憩を挟み、午後はプロトタイプの制作時間にしました。2 時間あったので、1 時間を 2 セット繰り返しました。1 回目は、とりあえずで制作を終えて、印刷とラミネート加工まで通しでやりました。まずは現物がどういうものになるのか実際に見て触ってもらい、それを踏まえて 2 回目の制作に臨みました。文字や色を見やすく変えるチューニング、QR コードを意匠の一部とするアイデア、「？」マークで一部の画面を隠し見たい欲求を煽るなど、制作に様々な変化が生まれました。',
    },
    {
      type: 'image',
      image: {
        src: '/news/20211007/image2.jpg',
        width: 1200,
        height: 900,
        alt: '制作したプロトタイプ',
      },
    },
    {
      type: 'text',
      text: '学生のプロトタイプからたくさんの刺激とアイデアを頂きました。同様の機会を増やしていければと考えております。学校関係者の方、是非お声がけください。',
    },
  ],
}
