import { ILetter } from '../src/types/letter'

export const news20211211: ILetter = {
  id: '2021-12-11',
  title: 'ママドラフト会議in山口の採用',
  description: 'ママドラフト会議2021in山口にて、育児中のママさん1名を採用しました。',
  thumbnail: '/news/20211211/thumbnail.jpg',
  date: '2021-12-11T09:00:00.000Z',
  tags: ['会社'],
  isRecommended: true,
  paragraphs: [
    {
      type: 'text',
      text: 'ママドラフトは新たな就労を目指すママさんと地元企業の出会いの場です。1 ヶ月前のキックオフセミナーに参加し、ママさんたちの就労を取り巻く現状の説明を受けました。過去の経験を活かしたい、新しいキャリアに挑戦したいと思いつつも、育児による制限で求職活動を控えている潜在的なママさんが山口県内だけでも試算上 1.4 万人近くいるそうです。今後の労働人口減を見越して、行政がこの潜在的なリソースを活かすべく施策を推し進めています。',
    },
    {
      type: 'link',
      url: 'https://restep.npoatto.org/mamadora/',
    },
    {
      type: 'text',
      text: 'ママさんと企業は自らの情報と希望を記載して事前に交換していました。その前情報を持ちつつ、ドラフト当日の交流時間に多くのママさんと会話しました。その中から美大を卒業され広告代理店に勤務されていた 1 名の方に連絡し、後日面談を実施しました。今までの経験を活かして弊社のサービスや販促のデザイン業務を担って頂きつつ、新たに Web デザインの領域に挑戦して欲しい旨を伝えました。弊社の業務上、基本在宅で良いこと（隔週に 1 回だけ出社して会議）、稼働時間の調整を任せることも伝えました。',
    },
    {
      type: 'text',
      text: 'しっかり時間を取って考えていただいた末、契約合意に至りました。小さいお子さんがいるため、数年はパートタイムでの雇用形態が続きそうですが、地道に業務に取り組んでいただき、将来きっと大きく活躍していただけると信じています。',
    },
  ],
}
