import { ILetter } from '../src/types/letter'

export const news20221008: ILetter = {
  id: '2022-10-08',
  title: '親子参加プログラミング体験会の講師',
  description:
    '山口県のやまぐちデジタルマンスリーのトップバッターとして親子参加のプログラミング体験会の講師を務めました。',
  thumbnail: '/news/20221008/thumbnail.jpg',
  date: '2022-10-08T09:00:00.000Z',
  tags: ['教育'],
  isRecommended: true,
  paragraphs: [
    {
      type: 'link',
      url: 'https://digitech-ymg.org/event/717',
    },
    {
      type: 'text',
      text: '今まで実施してきた体験会は主に子供のみに向けたものでしたが、志向を変えて親御さん一緒に参加する機会にしていただきました。教材はいつものスクラッチですが、参加者の個性を引き出すためアニメーションを創作対象としました。まず最初の30分は、スクラッチの基礎的な使い方を手と頭を動かしながら練習して、プログラムの命令を組み立てることに馴染んでもらいました。',
    },
    {
      type: 'image',
      image: {
        src: '/news/20221008/image1.jpg',
        width: 960,
        height: 720,
        alt: '冒頭でプログラミングの概要を説明している講師',
      },
    },
    {
      type: 'text',
      text: '次の1時間はフリータイムとし、各自が創作を進める時間としました。メッセージという機能と使い方を伝えて、キャラクター同士の会話や動きをスムーズに繋げるよう促しました。キャラクターや背景は標準でたくさん用意されており、それぞれが違った世界観でアニメーションを楽しんで開発していました。参加者の席を回り、やりたいことや質問に対する助言をしました。',
    },
    {
      type: 'image',
      image: {
        src: '/news/20221008/image2.jpg',
        width: 960,
        height: 720,
        alt: '制作途中の画面を覗き込む講師',
      },
    },
    {
      type: 'text',
      text: '最後の余った時間は、発表の時間にしました。参加者の作品を大型スクリーンに投影して紹介しつつ、講師がお子さんに対していくつか質問をして回答してもらいました。中には、前に出て発表するお子さんもおられました。',
    },
    {
      type: 'image',
      image: {
        src: '/news/20221008/image3.jpg',
        width: 960,
        height: 720,
        alt: '参加者の様子',
      },
    },
    {
      type: 'image',
      image: {
        src: '/news/20221008/image4.jpg',
        width: 960,
        height: 720,
        alt: '発表した生徒に質問する講師',
      },
    },
    {
      type: 'text',
      text: '最後に記念撮影です。2時間があっという間に過ぎ、どのお子さんもしっかり楽しんだ顔が印象的でした。親御さんの理解も深まったようなので、引き続き自宅でもプログラミングに触れていただければと思います。',
    },
    {
      type: 'image',
      image: {
        src: '/news/20221008/image5.jpg',
        width: 960,
        height: 720,
        alt: '参加した子ども一同と講師の記念撮影',
      },
    },
    {
      type: 'text',
      text: 'デジテックのnoteに体験会の詳しい様子を書いていただいています。こちらも併せてご覧ください。',
    },
    {
      type: 'link',
      url: 'https://note.com/digitech_ymg/n/n4d2959177e21',
    },
  ],
}
