import { ILetter } from '../src/types/letter'

export const news20230206: ILetter = {
  id: '2023-02-06',
  title: 'レノファ山口のパートナー契約更新',
  description:
    '株式会社スオウは昨年に続き株式会社レノファ山口2023シーズンのオフィシャルパートナー契約を締結しました。',
  thumbnail: '/news/20230206/thumbnail.webp',
  date: '2023-02-06T09:00:00.000Z',
  tags: ['会社'],
  isRecommended: true,
  paragraphs: [
    {
      type: 'text',
      text: 'トップチームのビブス前面に弊社ロゴが入ります。ビブスは練習時、または試合のサブメンバーが着用します。J1の高みに到達するには、試合に向けた入念な意識と準備が欠かせません。選手層の厚さで1試合ごとに勝ち点を積み上げていけるよう願っております。',
    },
    {
      type: 'image',
      image: {
        src: '/news/20230206/image1.jpg',
        width: 640,
        height: 850,
        alt: 'ビブス全面に弊社ロゴ',
      },
    },
    {
      type: 'text',
      text: '昨シーズンは、試合会場にプログラミングで作られたゲームの試遊ブースを出展しました。子供を中心にたくさんの方が試遊されて、プログラミングと弊社事業の存在を知っていただきました。ゲームのイラストは、山口県内でお馴染みの、りおた氏に書き下ろしていただき、県内の繋がりの輪も広げることができました。',
    },
    {
      type: 'image',
      image: {
        src: '/news/20230206/image2.jpg',
        width: 960,
        height: 720,
        alt: 'レディースユニフォームの写真',
      },
    },
    {
      type: 'image',
      image: {
        src: '/news/20230206/image3.jpg',
        width: 960,
        height: 720,
        alt: 'レディースユニフォームの写真',
      },
    },
    {
      type: 'text',
      text: '昨年12月に電撃就任された渡部社長に早速面識を持たせて頂き、この度のパートナー契約更新に際して一言を頂戴したので、ここで紹介させて頂きます。',
    },
    {
      type: 'blockquote',
      text: 'この度、株式会社スオウ様とパートナー契約を更新でき、大変嬉しく思います。昨シーズンはコロナ禍の制限がある中にも関わらず、レディースへのご協賛、スタジアムでのイベントを実施していただき心から感謝申し上げます。プログラミングを通して子どもたちの育成やWeb開発など、新たな教育事業へチャレンジし続けていく姿勢に共感し、「IT×スポーツ」の力で共に山口県を盛り上げていければと思います。今シーズンも熱いご支援、ご声援をどうぞよろしくお願い致します。',
      author: '株式会社レノファ山口 代表取締役社長 渡部博文',
    },
    {
      type: 'text',
      text: '株式会社スオウはトップチームのみならずユース/レディース/アカデミー/スタッフを含めレノファ山口全体を応援していきます。山口県内にお住まいの皆さんもぜひ、スタジアムまで足を運びレノファと一緒に夢を追いかけましょう！',
    },
  ],
}
